app/views/book/edit.html.erb

SELECT `subjects`.* FROM `subjects`
---
<p>Price:<%= f.text_field 'price' %></p>
<p>Subject:<%= collection_select(:subject, :subject_id, Subject.all, :id, :name, prompt: true) %></p>