app/views/book/show_subjects.html.erb

<h1><%= @subject.name %></h1>
<% if @subject.books.blank? %>
---
SELECT `books`.* FROM `books` WHERE `books`.`subject_id` = 1