app/controllers/book_controller.rb

	def list
		@books=Book.all
---
SELECT `books`.* FROM `books`

	def new
		@book=Book.new
		@subjects=Subject.all
---
SELECT `subjects`.* FROM `subjects`

	def create
		@book=Book.new(book_params)
		if(@book.save)
---
INSERT INTO `books` (`title`, `price`, `subject_id`, `description`, `created_at`) VALUES ('advance physics by nitish arora', 50.0, 1, 'A beginner book for every type of students', '2017-04-16 05:22:10')

	def edit
		@book=Book.find(params[:id])
		@subjects=Subject.all
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
SELECT `subjects`.* FROM `subjects`

	def update
		@book=Book.find(params[:id])
		if @book.update_attributes(book_param)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
UPDATE `books` SET `description` = 'A beginner book for every type of student' WHERE `books`.`id` = 3

	def delete
		Book.find(params[:id]).destroy
---
DELETE FROM `books` WHERE `books`.`id` = 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

	def show_subjects
		@subject=Subject.find(params[:id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1